---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalResourceLoadContext
source: html/52be2e7f-ff7c-692c-2db6-6f5e2ecbd342.htm
---
# ExternalResourceLoadContext Members

Indicates whether the document requesting the external resource has a defined
 ModelPath.